In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [5]:
Oscar_nominated = pd.read_csv('Oscar_nominated.csv')

In [6]:
Oscar_nominated.head()

,year,movie,movie_id,certificate,duration,genre,rate,metascore,synopsis,votes,...,New_York_Film_Critics_Circle_nominated,New_York_Film_Critics_Circle_nominated_categories,Los_Angeles_Film_Critics_Association_won,Los_Angeles_Film_Critics_Association_won_categories,Los_Angeles_Film_Critics_Association_nominated,Los_Angeles_Film_Critics_Association_nominated_categories,release_date.year,release_date.month,release_date.day-of-month,release_date.day-of-week
0,2001,Kate & Leopold,tt0035423,PG-13,118,Comedy|Fantasy|Romance,6.4,44.0,An English Duke from 1876 is inadvertedly drag...,66660,...,0,NaN,0,NaN,0,NaN,2001.0,12.0,25.0,2.0
1,2000,Chicken Run,tt0120630,G,84,Animation|Adventure|Comedy,7.0,88.0,When a cockerel apparently flies into a chicke...,144475,...,1,Best Animated Film,1,Best Animation,1,Best Animation,2000.0,6.0,23.0,5.0
2,2005,Fantastic Four,tt0120667,PG-13,106,Action|Adventure|Family,5.7,40.0,A group of astronauts gain superpowers after a...,273203,...,0,NaN,0,NaN,0,NaN,2005.0,7.0,8.0,5.0
3,2002,Frida,tt0120679,R,123,Biography|Drama|Romance,7.4,61.0,"A biography of artist Frida Kahlo, who channel...",63852,...,0,NaN,0,NaN,0,NaN,2002.0,11.0,22.0,5.0
4,2001,The Lord of the Rings: The Fellowship of the Ring,tt0120737,PG-13,178,Adventure|Drama|Fantasy,8.8,92.0,A meek Hobbit from the Shire and eight compani...,1286275,...,0,NaN,1,Best Music,2,Best Music|Best Production Design,2001.0,12.0,19.0,3.0

In [7]:
# Keeping specific parameters
columns_to_keep = ["movie", "duration", "metascore", "gross", "awards_nominations", "Golden_Globes_nominated", "Oscar_nominated"]

reduced_df = Oscar_nominated[columns_to_keep]

In [8]:
oscars_df = reduced_df.rename(columns={"Golden_Globes_nominated": "golden_globes_nominated", "Oscar_nominated":"oscar_nominated"})
oscars_df.head()

,movie,duration,metascore,gross,awards_nominations,golden_globes_nominated,oscar_nominated
0,Kate & Leopold,118,44.0,47100000.0,4,2,1
1,Chicken Run,84,88.0,106790000.0,11,1,0
2,Fantastic Four,106,40.0,154700000.0,0,0,0
3,Frida,123,61.0,25780000.0,12,2,6
4,The Lord of the Rings: The Fellowship of the Ring,178,92.0,313840000.0,67,4,13

In [9]:
# Replace all values in oscar nominated column with boolean 1's and 0's
oscars_df["oscar_nominated"] = np.where((oscars_df['oscar_nominated'] >= 1),1,oscars_df['oscar_nominated'])

In [10]:
train_df = oscars_df[["duration", "metascore", "gross", "awards_nominations", "golden_globes_nominated", "oscar_nominated"]]

In [11]:
train_df.head()

,duration,metascore,gross,awards_nominations,golden_globes_nominated,oscar_nominated
0,118,44.0,47100000.0,4,2,1
1,84,88.0,106790000.0,11,1,0
2,106,40.0,154700000.0,0,0,0
3,123,61.0,25780000.0,12,2,1
4,178,92.0,313840000.0,67,4,1

In [12]:
oscars_df.to_csv("oscars_df.csv", index=True)